# Pandas Assignments

In [1]:
# Libraries
import numpy as np
import pandas as pd
from datetime import datetime

### 1) Create a Datatime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe.

In [2]:
df = pd.DataFrame(np.random.randint(0,30,size=10),
                  columns = ["Random"],
                  index = pd.date_range(datetime.now(), periods=10, freq="B"))
df
# FREQ = D BY DEFAULT PRINTS ALL DAYS
# FREQ = B ONLY BUSINESS DAYS

                            Random
2020-03-02 22:27:40.045083      20
2020-03-03 22:27:40.045083      11
2020-03-04 22:27:40.045083      21
2020-03-05 22:27:40.045083      19
2020-03-06 22:27:40.045083       6
2020-03-09 22:27:40.045083       4
2020-03-10 22:27:40.045083       8
2020-03-11 22:27:40.045083      15
2020-03-12 22:27:40.045083      27
2020-03-13 22:27:40.045083       6

### 2) Given Pandas series , height = \[23,42,55\] and weight = \[71,32,48\] . Create a dataframe with height and weight as column names.

In [3]:
height = [23,42,55]
weight = [71,32,48]
df = pd.DataFrame(list(zip(height, weight)), columns = ["height", "weight"])
df

   height  weight
0      23      71
1      42      32
2      55      48

### 3) How to get the items of series A not present in series B .From ser1 remove items present in ser2.

ser1 = pd.Series(\[2, 3, 4, 5\])<br>
ser2 = pd.Series(\[5, 6, 7, 8\])

In [4]:
ser1 = pd.Series([2, 3, 4, 5])
ser2 = pd.Series([5, 6, 7, 8])
ser1[np.logical_not(ser1.isin(ser2))]

0    2
1    3
2    4
dtype: int64

## Questions on Titanic Dataset

In [5]:
titanic_df = pd.read_csv(r"F:\Projects\end_to_end_data_sets\titanic.csv")
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 4) Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset

In [6]:
titanic_df.describe()['Age']

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [7]:
titanic_df.median()['Age'] # Same as 50%

28.0

### 5) How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset

In [8]:
titanic_df['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

### 6) Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset

In [9]:
kexx = titanic_df['SibSp'].value_counts().keys()[:2]

titanic_df.loc[titanic_df['SibSp'].isin(list(kexx)), 'Embarked'] = "Other"

In [10]:
titanic_df["Embarked"].value_counts()

Other    817
S         61
Q          7
C          6
Name: Embarked, dtype: int64

### 7) Bin the price column in titanic data set into 5 equal groups and get counts of each bin

In [11]:
max(titanic_df['Fare'])

512.3292

In [12]:
min(titanic_df['Fare'])

0.0

In [13]:
titanic_df["Price"] = pd.qcut(titanic_df.Fare,q = 5,labels=['Very Low', 'Low', 'Medium', 'High', 'Very High'], precision=0)
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Price
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,Other,Very Low
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,Other,Very High
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,Other,Low
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,Other,Very High
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,Other,Low
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,Other,Medium
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,Other,High
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,Other,High
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,Other,High
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Other,Very Low

In [14]:
titanic_df["Price"].value_counts()

Low          184
High         180
Very Low     179
Very High    176
Medium       172
Name: Price, dtype: int64

### 8) Count the number of missing values in each column?

In [15]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
Price            0
dtype: int64

### 9) Get the row number of the 5th largest value in the Age column of titanic dataset?

In [16]:
titanic_df.nlargest(5, ['Age'])[-1:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Price
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.75,NaN,Other,Very Low

### 10) Normalize all columns in a dataframe?

In [17]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       891 non-null object
Price          891 non-null category
dtypes: category(1), float64(2), int64(5), object(5)
memory usage: 84.7+ KB

In [18]:
int_titanic_df = titanic_df.select_dtypes(exclude=['object', 'category'])

In [19]:
normalized_df=(int_titanic_df-int_titanic_df.mean())/int_titanic_df.std() * 20

In [20]:
normalized_df

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
0,-34.582736,-15.776586,16.538256,-10.600102,8.651009,-9.468154,-10.043263
1,-34.505022,25.325572,-31.304557,11.428608,8.651009,-9.468154,15.728072
2,-34.427308,25.325572,16.538256,-5.092924,-9.485576,-9.468154,-9.771597
3,-34.349594,25.325572,-31.304557,7.298225,8.651009,-9.468154,8.409881
4,-34.271880,-15.776586,16.538256,7.298225,-9.485576,-9.468154,-9.721289
...,...,...,...,...,...,...,...
886,34.271880,-15.776586,-7.383150,-3.716130,-9.485576,-9.468154,-7.729073
887,34.349594,25.325572,-31.304557,-14.730485,-9.485576,-9.468154,-0.887123
888,34.427308,-15.776586,16.538256,NaN,8.651009,40.156114,-3.523286
889,34.505022,25.325572,-31.304557,-5.092924,-9.485576,-9.468154,-0.887123
890,34.582736,-15.776586,16.538256,3.167842,-9.485576,-9.468154,-9.842029

### 11) Get the indices of items of ser2 in ser1 as a list.

ser1 = pd.Series(\[10, 9, 6, 5, 3, 1, 12, 8, 13\])<br>
ser2 = pd.Series(\[1, 3, 10, 13\])

In [21]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

In [22]:
ser1

0    10
1     9
2     6
3     5
4     3
5     1
6    12
7     8
8    13
dtype: int64

In [23]:
ser1[[1, 3, 10, 13]]

1     9.0
3     5.0
10    NaN
13    NaN
dtype: float64

### 12) How to convert a series of date-strings to a timeseries?

\["01 Jan 2010", "02-02-2011", "20120303", "2013/04/04", "2014-05-05", "2015-06-06T12:20"\]

In [24]:
date_series = ["01 Jan 2010", "02-02-2011", "20120303", "2013/04/04", "2014-05-05", "2015-06-06T12:20"]
pd.to_datetime(date_series)

DatetimeIndex(['2010-01-01 00:00:00', '2011-02-02 00:00:00',
               '2012-03-03 00:00:00', '2013-04-04 00:00:00',
               '2014-05-05 00:00:00', '2015-06-06 12:20:00'],
              dtype='datetime64[ns]', freq=None)

### 13) Get the day of month, week number, day of year and day of week from ser.

ser = pd.Series(\["01 Jan 2010", "02-02-2011", "20120303", "2013/04/04", "2014-05-05", "2015-06-06T12:20"\])

In [25]:
ser = pd.Series(["01 Jan 2010", "02-02-2011", "20120303", "2013/04/04", "2014-05-05", "2015-06-06T12:20"])
norm_date = pd.to_datetime(ser)

print("Day of month:")
print(norm_date.dt.day.tolist())
print("\nWeek number:")
print(norm_date.dt.weekofyear.tolist())
print("\nDay of year:")
print(norm_date.dt.dayofyear.tolist())
print("\nDay of week:")
print(norm_date.dt.weekday_name.tolist())

Day of month:
[1, 2, 3, 4, 5, 6]

Week number:
[53, 5, 9, 14, 19, 23]

Day of year:
[1, 33, 63, 94, 125, 157]

Day of week:
['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

### 14) Compute the euclidean distance between series (points) p and q, without using a packaged formula.

p = pd.Series(\[1, 2, 3, 4, 5, 6, 7, 8, 9, 10\])<br>
q = pd.Series(\[10, 9, 8, 7, 6, 5, 4, 3, 2, 1\])

Desired Output 18.165

In [26]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
print("Euclidean Distance: {}".format(sum((a - b) ** 2 for a, b in zip(p, q)) ** .5))

Euclidean Distance: 18.16590212458495

### 15) How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)

In [27]:
df = pd.Series(pd.date_range("2000-01-01", periods=100))
df.loc[df.dt.weekday.isin([5, 6])][:10]

0    2000-01-01
1    2000-01-02
7    2000-01-08
8    2000-01-09
14   2000-01-15
15   2000-01-16
21   2000-01-22
22   2000-01-23
28   2000-01-29
29   2000-01-30
dtype: datetime64[ns]

### 16) Import every 50th row of BostonHousing dataset as a dataframe.

In [28]:
boston_df = pd.read_csv(r"F:\Projects\end_to_end_data_sets\boston_house_price.csv")
boston_df.head()
fifty_boston = boston_df.iloc[::50, :]
fifty_boston

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
50,0.08873,21.0,5.64,0.0,0.439,5.963,45.7,6.8147,4.0,243.0,16.8,395.56,13.45,19.7
100,0.14866,0.0,8.56,0.0,0.520,6.727,79.9,2.7778,5.0,384.0,20.9,394.76,9.42,27.5
150,1.65660,0.0,19.58,0.0,0.871,6.122,97.3,1.6180,5.0,403.0,14.7,372.80,14.10,21.5
200,0.01778,95.0,1.47,0.0,0.403,7.135,13.9,7.6534,3.0,402.0,17.0,384.30,4.45,32.9
250,0.14030,22.0,5.86,0.0,0.431,6.487,13.0,7.3967,7.0,330.0,19.1,396.28,5.90,24.4
300,0.04417,70.0,2.24,0.0,0.400,6.871,47.4,7.8278,5.0,358.0,14.8,390.86,6.07,24.8
350,0.06211,40.0,1.25,0.0,0.429,6.490,44.4,8.7921,1.0,335.0,19.7,396.90,5.98,22.9
400,25.04610,0.0,18.10,0.0,0.693,5.987,100.0,1.5888,24.0,666.0,20.2,396.90,26.77,5.6
450,6.71772,0.0,18.10,0.0,0.713,6.749,92.6,2.3236,24.0,666.0,20.2,0.32,17.44,13.4
500,0.22438,0.0,9.69,0.0,0.585,6.027,79.7,2.4982,6.0,391.0,19.2,396.90,14.33,16.8